farzan-saleem/RA6T3_Setup/src/application/tuner/r_aid_tuner_gui.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_aid_tuner_gui.c
 * Description  : This module solves all the world's problems
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
*          : 09.12.2021 1.00
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
#include <stdbool.h>
#include "r_aid_config.h"
#include "r_aid_tuner_gui.h"
#include "r_aid_auto_identify.h"
#include "r_mtr_ics.h"
#include "r_aid_tuner_gui_user.h"

#include "hal_data.h"

/***********************************************************************************************************************
 Macro definitions
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Typedef definitions
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 **********************************************************************************************************************/
enum
{
    RMW_ACT_NONE = 0,
    RMW_ACT_TUNER_START = 1,
    RMW_ACT_TUNER_STOP = 2,
    RMW_ACT_TUNER_RESET = 3,
    RMW_ACT_APPLY_MOTOR_PARAMS = 4,
    RMW_ACT_TUNER_APPLY_PARAMS = 5
} gui_s4_rmw_action;    /*< Action code from Renesas motor workbench, will be set 0 after non 0 value written */

uint8_t  gui_u1_use_init_r = false;
uint8_t  gui_u1_use_init_ld = false;
uint8_t  gui_u1_use_init_lq = false;
uint8_t  gui_u1_use_init_ke = false;
uint8_t  gui_u1_only_clear_error = false;
uint8_t  gui_u1_params_applied = false;
uint16_t gui_u2_tuner_status;
float    gui_f4_init_r;
float    gui_f4_init_ld;
float    gui_f4_init_lq;
float    gui_f4_init_ke;
float    gui_f4_r;
float    gui_f4_ld;
float    gui_f4_lq;
float    gui_f4_ke;
float    gui_f4_j;
float    gui_f4_d;
st_aid_volterr_lut_t gui_st_volterr_lut;
float    gui_f4_volterr_table_current[5];
float    gui_f4_volterr_table_volterr[5];

st_aid_volterr_lut_t g_st_volterr_lut =
{
    .current_table =
    {
        AIDU_TBL_COMP_I0,
        AIDU_TBL_COMP_I1,
        AIDU_TBL_COMP_I2,
        AIDU_TBL_COMP_I3,
        AIDU_TBL_COMP_I4
    },
    .volterr_table =
    {
        AIDU_TBL_COMP_V0,
        AIDU_TBL_COMP_V1,
        AIDU_TBL_COMP_V2,
        AIDU_TBL_COMP_V3,
        AIDU_TBL_COMP_V4
    },
    .ref_voltage =
    {
        AIDU_REF_VOLTAGE
    }
};

uint16_t gui_u2_error_status;
uint8_t  gui_u1_tune_mode;
uint16_t gui_u2_measure_progress;
float    aid_f4_measure_progress;
uint8_t  gui_u1_flag_tune_result;
uint8_t  gui_u1_flg_reset = 0;
uint8_t  gui_u1_para_setting = 0;
uint8_t  gui_u1_flag_tune_mode = 1;
float    gui_f4_slide_parameter = 50;
uint8_t  gui_u1_active_gui;
uint8_t  gui_u1_flg_1para_init = 0;
float    gui_f4_1para_speed_omega;
float    gui_f4_1para_pos_omega;
extern uint8_t gui_u1_volterr_is_enabled;
/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static uint8_t gs_u1_is_tuner_running = false;

static void tuner_act_ready(void);
static void tuner_act_measure(void);
static void tuner_act_error(void);
static void tuner_act_completed(void);
static void tuner_save_identified_params(void);
static void tuner_reset(void);
static void rmw_act_start(void);
static uint16_t rmw_get_progress(void);
static void r_aid_config_init(void);
static void r_aid_config_fp_init(void);

