farzan-saleem/RA6T3_Setup/src/application/tuner/r_aid_tuner_gui.c
/***********************************************************************************************************************
* Function Name : R_TUNER_InitGUI
* Description   : 
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void R_TUNER_InitGUI (void)
{
    gui_u1_volterr_is_enabled = 0;
    
    r_aid_config_init();
    r_aid_config_fp_init();
    
    R_AID_Init(AIDU_PWM_TICK_PER_IRQ, AIDU_SPEED_CTRL_PERIOD);
    R_AID_ConfigSetVolterrLUT(&g_st_volterr_lut);
} /* End of function R_TUNER_InitGUI() */

/***********************************************************************************************************************
* Function Name : R_TUNER_MainLoop
* Description   : 
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void R_TUNER_MainLoop (void)
{
    /* Start Button */
    if (gui_u1_tune_mode == AIDU_TUNE_MODE_START)
    {
        R_AID_Init(AIDU_PWM_TICK_PER_IRQ, AIDU_SPEED_CTRL_PERIOD);
        R_AID_ConfigSetVolterrLUT(&g_st_volterr_lut);
        gui_s4_rmw_action = RMW_ACT_TUNER_START;
        gui_u1_tune_mode = AIDU_TUNE_MODE_MAX;
    }

    /* Reset Button */
    if (gui_u2_tuner_status == AID_STATUS_RESET)
    {
        gui_s4_rmw_action = RMW_ACT_TUNER_RESET;
        rmw_apply_reset();
    }

    /* Stop Button */
    if (gui_u2_error_status == AIDU_ERROR_ASSERT_FAIL)
    {
        R_AID_UserError(AIDU_ERROR_STOP_BUTTON);
    }
    
    gui_u2_tuner_status = R_AID_GetSystemStatus();
    switch(gui_u2_tuner_status)
    {
        case AID_STATUS_READY:
        {
            gui_u2_measure_progress = 0;
            tuner_act_ready();
        }
        break;

        case AID_STATUS_MEASURE:
        {
            tuner_act_measure();
            gui_u2_measure_progress = rmw_get_progress();
        }
        break;

        case AID_STATUS_ERROR:
        {
            gui_u2_error_status = R_AID_GetErrorStatus();
            tuner_act_error();
        }
        break;

        case AID_STATUS_COMPLETED:
        {
            tuner_act_completed();
        }
        break;

        default:
        {
            /* Do nothing */
        }
    }

    /* Clear command/action to make sure the command is only executed once */
    gui_s4_rmw_action = RMW_ACT_NONE;
} /* End of function R_TUNER_MainLoop() */

/***********************************************************************************************************************
* Function Name : R_TUNER_IsRunning
* Description   : 
* Arguments     : None
* Return Value  : 
***********************************************************************************************************************/
uint8_t R_TUNER_IsRunning(void)
{
    return gs_u1_is_tuner_running;
} /* End of function R_TUNER_IsRunning() */


/***********************************************************************************************************************
* Function Name : R_TUNER_SetTuneResult
* Description   : Set gui_u1_flag_tune_result
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void R_TUNER_SetTuneResult(void)
{
    gui_u1_flag_tune_result = AIDU_FLG_SET;
} /* End of function R_TUNER_SetTuneResult() */

/***********************************************************************************************************************
* Function Name : R_TUNER_GetFlugReset
* Description   : Get gui_u1_flg_reset
* Arguments     : None
* Return Value  : 
***********************************************************************************************************************/
uint8_t R_TUNER_GetFlugReset(void)
{
    return gui_u1_flg_reset;
} /* End of function R_TUNER_GetFlugReset() */

/***********************************************************************************************************************
* Function Name : R_TUNER_SetFlugReset
* Description   : Set gui_u1_flg_reset
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void R_TUNER_SetFlugReset(uint8_t num)
{
    gui_u1_flg_reset = num;
} /* End of function R_TUNER_GetFlugReset() */

/***********************************************************************************************************************
* Function Name : tuner_act_ready
* Description   : 
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
static void tuner_act_ready(void)
{
    switch(gui_s4_rmw_action)
    {
        case RMW_ACT_TUNER_START:
        {
            rmw_act_start();
            gs_u1_is_tuner_running = true;
        }
        break;

        default:
        {
            gs_u1_is_tuner_running = false;
        }
    }
} /* End of function tuner_act_ready() */

/***********************************************************************************************************************
* Function Name : tuner_act_measure
* Description   : 
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
static void tuner_act_measure(void)
{
    switch(gui_s4_rmw_action)
    {
        case RMW_ACT_TUNER_STOP:
        {
            R_AID_CmdStop();
            gs_u1_is_tuner_running = false;
        }
        break;

        default:
        {
            /* Do nothing */
        }
    }
} /* End of function tuner_act_measure() */

/***********************************************************************************************************************
* Function Name : tuner_act_error
* Description   : 
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
static void tuner_act_error(void)
{
    switch(gui_s4_rmw_action)
    {
        case RMW_ACT_TUNER_RESET:
        {
            tuner_reset();
            gs_u1_is_tuner_running = true;
        }
        break;

        default:
        {
            gs_u1_is_tuner_running = false;
        }
    }
} /* End of function tuner_act_error() */

